namespace DiffCode.CommonEntities.Sources;

class LegalEntities
{




  public static List<string> Adjectives =>
  [
    "Полное",
    "Акционерное",
    "Унитарное",
    "Производственный",
    "Хозяйственное",
    "Индивидуальный",
    "Простое",
    "Инвестиционное",
    "Некоммерческое",
    "Публичное",
    "Непубличное",
    "Федеральное",
    "Государственное",
    "Муниципальное",
    "Бюджетное",
    "Областное",
  ];



  public static List<string> Nouns =>
  [
    "Общество",
    "Товарищество",
    "Предприятие",
    "Кооператив",
    "Предприниматель",
    "Партнерство",
    "Учреждение",
  ];



  public static List<string> Patterns =>
  [
    @"публичное|непубличное акционерное общество *",
    @"индивидуальный предприниматель",
    @"инвестиционное|полное|простое товарищество *",
    @"общество *",
    @"федеральное государственное унитарное предприятие *",
    @"производственный кооператив *",
    @"хозяйственное|некоммерческое партнерство *",
    @"товарищество *",
  ];



}
