namespace DiffCode.CommonEntities.Sources;

class PersonNameGrammars
{





  public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> FFirstNames => new Dictionary<string, (string, string, string, string, string, string)>
  {
    ["[аейлось]я"] = new("я", "и", "е", "ю", "ей", "е"),
    ["[бвдеёжзийлмнпрстфхцчшщ]а"] = new("а", "ы", "е", "у", "ой", "е"),
    ["[длмр]и"] = new("и", "и", "и", "и", "и", "и"),
    ["[Ии]я"] = new("я", "и", "и", "ю", "ей", "и"),
    ["[кг]а"] = new("а", "и", "е", "у", "ой", "е"),
    ["бель"] = new("бель", "бель", "бель", "бель", "бель", "бель"),
    ["бет"] = new("бет", "бет", "бет", "бет", "бет", "бет"),
    ["ид"] = new("ид", "ид", "ид", "ид", "ид", "ид"),
    ["ит"] = new("ит", "ит", "ит", "ит", "ит", "ит"),
    ["не"] = new("не", "не", "не", "не", "не", "не"),
    ["су"] = new("су", "су", "су", "су", "су", "су"),
    ["ь"] = new("ь", "и", "и", "ь", "ью", "и"),
    ["э"] = new("э", "э", "э", "э", "э", "э"),
  };




  public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> MFirstNames => new Dictionary<string, (string, string, string, string, string, string)>
  {
    ["[адиоуя]р"] = new("р", "ра", "ру", "ра", "ром", "ре"),
    ["[ао]в"] = new("в", "ва", "ву", "ва", "вом", "ве"),
    ["[бвдеёжзийлмнпрстфхцчшщ]а"] = new("а", "ы", "е", "у", "ой", "е"),
    ["[бгджзкмнпстфхцчшщ]"] = new("", "а", "у", "а", "ом", "е"),
    ["[длмр]и"] = new("и", "и", "и", "и", "и", "и"),
    ["[ес]тр"] = new("тр", "тра", "тру", "тра", "тром", "тре"),
    ["[илор]л"] = new("л", "ла", "лу", "ла", "лом", "ле"),
    ["[лр]ь"] = new("ь", "я", "ю", "я", "ем", "е"),
    ["[мтв]а"] = new("а", "ы", "е", "у", "ой", "е"),
    ["[рт]о"] = new("о", "о", "о", "о", "о", "о"),
    ["авел"] = new("авел", "авла", "авлу", "авла", "авлом", "авле"),
    ["ай"] = new("ай", "ая", "аю", "ая", "аем", "ае"),
    ["ви"] = new("ви", "ви", "ви", "ви", "ви", "ви"),
    ["ев"] = new("ев", "ева", "еву", "ева", "евым", "еве"),
    ["ей"] = new("ей", "ея", "ею", "ея", "еем", "ее"),
    ["ео"] = new("ео", "ео", "ео", "ео", "ео", "ео"),
    ["ётр"] = new("ётр", "етра", "етру", "етра", "етром", "етре"),
    ["ий"] = new("ий", "ия", "ию", "ия", "ием", "ии"),
    ["ка"] = new("ка", "ки", "ке", "ку", "кой", "ке"),
    ["мвел"] = new("мвел", "мвела", "мвелу", "мвела", "мвелом", "мвеле"),
    ["не"] = new("не", "не", "не", "не", "не", "не"),
    ["нила"] = new("нила", "нилы", "ниле", "нилу", "нилой", "ниле"),
    ["но"] = new("но", "но", "но", "но", "но", "но"),
    ["уи"] = new("уи", "уи", "уи", "уи", "уи", "уи"),
    ["э"] = new("э", "э", "э", "э", "э", "э"),
    ["я"] = new("я", "и", "е", "ю", "ёй", "е"),
  };




  public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> FMidNames => new Dictionary<string, (string, string, string, string, string, string)>
  {
    ["[вчш]на"] = new("на", "ны", "не", "ну", "ной", "не"),
  };




  public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> MMidNames => new Dictionary<string, (string, string, string, string, string, string)>
  {
    ["[вкмть]ич"] = new("ич", "ича", "ичу", "ича", "ичем", "иче"),
  };




  public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> MLastNames => new Dictionary<string, (string, string, string, string, string, string)>
  {
    ["[бвгдежзийклмнпрстфцч]о"] = new("о", "о", "о", "о", "о", "о"),
    ["[бвгмнря]да"] = new("да", "ды", "де", "ду", "дой", "де"),
    ["[бвклмнпстц]и"] = new("и", "и", "и", "и", "и", "и"),
    ["[еиоую]г"] = new("г", "га", "гу", "га", "гом", "ге"),
    ["[еиэ]да"] = new("да", "да", "да", "да", "да", "да"),
    ["[зйлмстш]он"] = new("он", "она", "ону", "она", "оном", "оне"),
    ["ава"] = new("ава", "авы", "аве", "аву", "авой", "аве"),
    ["аец"] = new("аец", "айца", "айцу", "айца", "айцем", "айце"),
    ["ай"] = new("ай", "ая", "аю", "ая", "аем", "ае"),
    ["ак"] = new("ак", "ака", "аку", "ака", "аком", "аке"),
    ["ань"] = new("ань", "аня", "аню", "аня", "анем", "ане"),
    ["ач"] = new("ач", "ача", "ачу", "ача", "ачом", "аче"),
    ["ба"] = new("ба", "бы", "бе", "бу", "бой", "бе"),
    ["бей"] = new("бей", "бей", "бей", "бей", "бей", "бей"),
    ["бий"] = new("бий", "бий", "бий", "бий", "бий", "бий"),
    ["вец"] = new("вец", "вца", "вцу", "вца", "вцом", "вце"),
    ["вий"] = new("вий", "вий", "вий", "вий", "вий", "вий"),
    ["гий"] = new("гий", "гого", "гому", "гого", "гим", "гом"),
    ["дер"] = new("дер", "дера", "деру", "дера", "дером", "дере"),
    ["дец"] = new("дец", "дца", "дцу", "дца", "дцом", "дце"),
    ["дзе"] = new("дзе", "дзе", "дзе", "дзе", "дзе", "дзе"),
    ["дь"] = new("дь", "дя", "дю", "дя", "дём", "де"),
    ["е"] = new("е", "е", "е", "е", "е", "е"),
    ["ев"] = new("ев", "ьва", "ьву", "ьва", "ьвом", "ьве"),
    ["ёв"] = new("ёв", "ёва", "ёву", "ёва", "ёвым", "ёве"),
    ["ел"] = new("ел", "ел", "ел", "ел", "ел", "ел"),
    ["ерг"] = new("ерг", "ерга", "ергу", "ерга", "ергом", "ерге"),
    ["заде"] = new("заде", "заде", "заде", "заде", "заде", "заде"),
    ["иа"] = new("иа", "иа", "иа", "иа", "иа", "иа"),
    ["иец"] = new("иец", "ийца", "ийцу", "ийца", "ийцем", "ийце"),
    ["ик"] = new("ик", "ика", "ику", "ика", "иком", "ике"),
    ["ин"] = new("ин", "ина", "ину", "ина", "иным", "ине"),
    ["их"] = new("их", "их", "их", "их", "их", "их"),
    ["ич"] = new("ич", "ича", "ичу", "ича", "ичем", "иче"),
    ["ия"] = new("ия", "ии", "ии", "ию", "ией", "ии"),
    ["кий"] = new("кий", "кого", "кому", "кого", "ким", "ком"),
    ["лец"] = new("лец", "льца", "льцу", "льца", "льцем", "льце"),
    ["лий"] = new("лий", "лия", "лию", "лия", "лием", "лие"),
    ["ль"] = new("ль", "ля", "лю", "ля", "лем", "ле"),
    ["льц"] = new("льц", "льца", "льцу", "льца", "льцем", "льце"),
    ["ля"] = new("ля", "ли", "ле", "лю", "лей", "ле"),
    ["ман"] = new("ман", "мана", "ману", "мана", "маном", "мане"),
    ["нен"] = new("нен", "нена", "нену", "нена", "неном", "нене"),
    ["нец"] = new("нец", "нца", "нцу", "нца", "нцем", "нце"),
    ["ов"] = new("ов", "ова", "ову", "ова", "овым", "ове"),
    ["оглы"] = new("оглы", "оглы", "оглы", "оглы", "оглы", "оглы"),
    ["оз"] = new("оз", "оза", "озу", "оза", "озом", "озе"),
    ["ой"] = new("ой", "ого", "ому", "ого", "им", "ом"),
    ["онь"] = new("онь", "оня", "оню", "оня", "онём", "оне"),
    ["рий"] = new("рий", "рий", "рий", "рий", "рий", "рий"),
    ["рс"] = new("рс", "рса", "рсу", "рса", "рсом", "рсе"),
    ["рц"] = new("рц", "рца", "рцу", "рца", "рцем", "рце"),
    ["рь"] = new("рь", "ря", "рю", "ря", "рём", "ре"),
    ["сен"] = new("сен", "сена", "сену", "сена", "сеном", "сене"),
    ["сий"] = new("сий", "сия", "сию", "сия", "сием", "сие"),
    ["тий"] = new("тий", "тий", "тий", "тий", "тий", "тий"),
    ["тор"] = new("тор", "тора", "тору", "тора", "тором", "торе"),
    ["уа"] = new("уа", "уа", "уа", "уа", "уа", "уа"),
    ["ук"] = new("ук", "ука", "уку", "ука", "уком", "уке"),
    ["ула"] = new("ула", "улы", "уле", "улу", "улой", "уле"),
    ["ус"] = new("ус", "уса", "усу", "уса", "усом", "усе"),
    ["ша"] = new("ша", "ши", "ше", "шу", "шой", "ше"),
    ["щ"] = new("щ", "ща", "щу", "ща", "щом", "ще"),
    ["ый"] = new("ый", "ого", "ому", "ого", "ым", "ом"),
    ["ын"] = new("ын", "ына", "ыну", "ына", "ыным", "ыне"),
    ["ых"] = new("ых", "ых", "ых", "ых", "ых", "ых"),
    ["ыч"] = new("ыч", "ыча", "ычу", "ыча", "ычом", "ыче"),
    ["э"] = new("э", "э", "э", "э", "э", "э"),
    ["юк"] = new("юк", "юка", "юку", "юка", "юком", "юке"),
    ["юх"] = new("юх", "юха", "юху", "юха", "юхом", "юхе"),
    ["як"] = new("як", "яка", "яку", "яка", "яком", "яке"),
    ["яка"] = new("яка", "яки", "яке", "яку", "якой", "яке"),
    ["ян"] = new("ян", "яна", "яну", "яна", "яном", "яне"),
    ["янь"] = new("янь", "янь", "янь", "янь", "янь", "янь"),

  };




  public static Dictionary<string, ValueTuple<string, string, string, string, string, string>> FLastNames => new Dictionary<string, (string, string, string, string, string, string)>
  {
    ["[бвгдежзийклмнпрстфцч]о"] = new("о", "о", "о", "о", "о", "о"),
    ["[бвгмнря]да"] = new("да", "да", "да", "да", "да", "да"),
    ["[бвклмнпстц]и"] = new("и", "и", "и", "и", "и", "и"),
    ["[еиоую]г"] = new("г", "г", "г", "г", "г", "г"),
    ["[еиэ]да"] = new("да", "да", "да", "да", "да", "да"),
    ["[зйлмстш]он"] = new("он", "он", "он", "он", "он", "он"),
    ["ава"] = new("ава", "ава", "ава", "ава", "ава", "ава"),
    ["аец"] = new("аец", "аец", "аец", "аец", "аец", "аец"),
    ["ай"] = new("ай", "ай", "ай", "ай", "ай", "ай"),
    ["ак"] = new("ак", "ак", "ак", "ак", "ак", "ак"),
    ["ань"] = new("ань", "ань", "ань", "ань", "ань", "ань"),
    ["ач"] = new("ач", "ач", "ач", "ач", "ач", "ач"),
    ["ба"] = new("ба", "ба", "ба", "ба", "ба", "ба"),
    ["бей"] = new("бей", "бей", "бей", "бей", "бей", "бей"),
    ["бий"] = new("бий", "бий", "бий", "бий", "бий", "бий"),
    ["вец"] = new("вец", "вец", "вец", "вец", "вец", "вец"),
    ["вий"] = new("вий", "вий", "вий", "вий", "вий", "вий"),
    ["гий"] = new("гий", "гий", "гий", "гий", "гий", "гий"),
    ["дер"] = new("дер", "дер", "дер", "дер", "дер", "дер"),
    ["дец"] = new("дец", "дец", "дец", "дец", "дец", "дец"),
    ["дзе"] = new("дзе", "дзе", "дзе", "дзе", "дзе", "дзе"),
    ["дь"] = new("дь", "дь", "дь", "дь", "дь", "дь"),
    ["е"] = new("е", "е", "е", "е", "е", "е"),
    ["ев"] = new("ева", "евой", "евой", "еву", "евой", "евой"),
    ["ёв"] = new("ёва", "ёвой", "ёвой", "ёву", "ёвой", "ёвой"),
    ["ел"] = new("ел", "ел", "ел", "ел", "ел", "ел"),
    ["ерг"] = new("ерг", "ерг", "ерг", "ерг", "ерг", "ерг"),
    ["заде"] = new("заде", "заде", "заде", "заде", "заде", "заде"),
    ["иа"] = new("иа", "иа", "иа", "иа", "иа", "иа"),
    ["иец"] = new("иец", "иец", "иец", "иец", "иец", "иец"),
    ["ик"] = new("ик", "ик", "ик", "ик", "ик", "ик"),
    ["ин"] = new("ина", "иной", "иной", "ину", "иной", "иной"),
    ["их"] = new("их", "их", "их", "их", "их", "их"),
    ["ич"] = new("ич", "ич", "ич", "ич", "ич", "ич"),
    ["ия"] = new("ия", "ия", "ия", "ия", "ия", "ия"),
    ["кий"] = new("кая", "кой", "кой", "кую", "кой", "кой"),
    ["лец"] = new("лец", "лец", "лец", "лец", "лец", "лец"),
    ["лий"] = new("лий", "лий", "лий", "лий", "лий", "лий"),
    ["ль"] = new("ль", "ль", "ль", "ль", "ль", "ль"),
    ["льц"] = new("льц", "льц", "льц", "льц", "льц", "льц"),
    ["ля"] = new("ля", "ли", "ле", "лю", "лей", "ле"),
    ["ман"] = new("ман", "ман", "ман", "ман", "ман", "ман"),
    ["нен"] = new("нен", "нен", "нен", "нен", "нен", "нен"),
    ["нец"] = new("нец", "нец", "нец", "нец", "нец", "нец"),
    ["ов"] = new("ова", "овой", "овой", "ову", "овой", "овой"),
    ["оглы"] = new("оглы", "оглы", "оглы", "оглы", "оглы", "оглы"),
    ["оз"] = new("оз", "оз", "оз", "оз", "оз", "оз"),
    ["ой"] = new("ая", "ой", "ой", "ую", "ой", "ой"),
    ["онь"] = new("онь", "онь", "онь", "онь", "онь", "онь"),
    ["рий"] = new("рий", "рий", "рий", "рий", "рий", "рий"),
    ["рс"] = new("рс", "рс", "рс", "рс", "рс", "рс"),
    ["рц"] = new("рц", "рц", "рц", "рц", "рц", "рц"),
    ["рь"] = new("рь", "рь", "рь", "рь", "рь", "рь"),
    ["сен"] = new("сен", "сен", "сен", "сен", "сен", "сен"),
    ["сий"] = new("сий", "сий", "сий", "сий", "сий", "сий"),
    ["тий"] = new("тий", "тий", "тий", "тий", "тий", "тий"),
    ["тор"] = new("тор", "тор", "тор", "тор", "тор", "тор"),
    ["уа"] = new("уа", "уа", "уа", "уа", "уа", "уа"),
    ["ук"] = new("ук", "ук", "ук", "ук", "ук", "ук"),
    ["ула"] = new("ула", "ула", "ула", "ула", "ула", "ула"),
    ["ус"] = new("ус", "ус", "ус", "ус", "ус", "ус"),
    ["ша"] = new("ша", "ши", "ше", "шу", "шой", "ше"),
    ["щ"] = new("щ", "щ", "щ", "щ", "щ", "щ"),
    ["ый"] = new("ая", "ой", "ой", "ую", "ой", "ой"),
    ["ын"] = new("ына", "ыной", "ыной", "ыну", "ыной", "ыной"),
    ["ых"] = new("ых", "ых", "ых", "ых", "ых", "ых"),
    ["ыч"] = new("ыч", "ыч", "ыч", "ыч", "ыч", "ыч"),
    ["э"] = new("э", "э", "э", "э", "э", "э"),
    ["юк"] = new("юк", "юк", "юк", "юк", "юк", "юк"),
    ["юх"] = new("юх", "юх", "юх", "юх", "юх", "юх"),
    ["як"] = new("як", "як", "як", "як", "як", "як"),
    ["яка"] = new("яка", "яка", "яка", "яка", "яка", "яка"),
    ["ян"] = new("ян", "ян", "ян", "ян", "ян", "ян"),
    ["янь"] = new("янь", "янь", "янь", "янь", "янь", "янь"),

  };




}