namespace DiffCode.CommonEntities.Sources;

class Units
{




  public static List<string> Adjectives =>
  [
    "рабочий",
    "календарный"
  ];



  public static List<string> Nouns =>
  [
    "минута",
    "час",
    "день",
    "неделя",
    "месяц",
    "квартал",
    "полугодие",
    "год",
    "рубль",
    "копейка",
    "доллар",
    "цент",
    "евро",
    "евроцент",
    "экземпляр",
    "штука",
    "процент",
    "доля",
    "число",
  ];



  public static List<string> Patterns =>
  [
    @"минута",
    @"час",
    @"(рабочий|календарный) день",
    @"неделя",
    @"месяц",
    @"квартал",
    @"полугодие",
    @"год",
    @"рубль",
    @"копейка",
    @"доллар",
    @"цент",
    @"евро",
    @"евроцент",
    @"экземпляр",
    @"штука",
    @"процент",
    @"доля",
    @"число",
  ];



}
